"""
Очень часто веб-дизайнеры используют HEX-значение какого-либо цвета.
Напишите программу принимающую 2 позиционных аргумента: слово "Цвета" и количество цветов.
и произвольное количество значений Цвет : HEX. Программа должна вывести все данные на экран.
"""

def test(word,num,**kwargs):
    print(word, num, kwargs)


test("Colors",2,red="#123123",blue = "#123123145")